#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/team-blackcat/e-com-blackcat/runs/run-bRAv7qm2Pmqjx9d8

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
data.google_secret_manager_secret.host: Reading...
data.google_secret_manager_secret.user: Reading...
data.google_secret_manager_secret.password: Reading...
data.google_secret_manager_secret.database: Reading...
data.google_secret_manager_secret.user: Read complete after 0s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-user-blackcat]
data.google_secret_manager_secret.password: Read complete after 0s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-password-blackcat]
data.google_secret_manager_secret.host: Read complete after 0s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-address]
data.google_secret_manager_secret.database: Read complete after 0s [id=projects/ceri-m1-ecommerce-2022/secrets/mysql-database-blackcat]
google_cloud_run_service.backend: Refreshing state... [id=locations/europe-west1/namespaces/ceri-m1-ecommerce-2022/services/blackcat-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.frontend will be created
  + resource "google_cloud_run_service" "frontend" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "blackcat-frontend"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = "terraform-blackcat@ceri-m1-ecommerce-2022.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-west1-docker.pkg.dev/ceri-m1-ecommerce-2022/blackcat/frontend-app:1.2.0"

                  + env {
                      + name  = "API_URL"
                      + value = "https://blackcat-backend-mwjszocsqa-ew.a.run.app"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_member.invokers_backend will be created
  + resource "google_cloud_run_service_iam_member" "invokers_backend" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "blackcat-backend"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + client_url = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "TF_VAR_GOOGLE_APPLICATION_CREDENTIALS" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-bRAv7qm2Pmqjx9d8/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```
</details>
*Pushed by: @iammouadagr, Action: `pull_request`*